{
  "plugins": {
    "actions-preview.nvim": {
      "src": "https://github.com/aznhe21/actions-preview.nvim"
    },
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp",
      "version": "1.0.0 - 2.0.0"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim"
    },
    "markdown-preview.nvim": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "mini.surround": {
      "src": "https://github.com/nvim-mini/mini.surround"
    },
    "neovim": {
      "src": "https://github.com/rose-pine/neovim"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "2.4.0 - 2.5.0"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim"
    },
    "typst-preview.nvim": {
      "src": "https://github.com/chomosuke/typst-preview.nvim"
    },
    "vague.nvim": {
      "src": "https://github.com/vague2k/vague.nvim"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}